000010 PROCEDURE DIVISION.
000020
000030 MAINLINE.
000040     MOVE 'Y' TO WS-FLAG.
000050     IF YES THEN PERFORM MOVE-IT.
000060
000070 MOVE-IT.
000080     MOVE WS-FLAG TO WS-OTHER-FLAG.
